clusterMHDTest/Cilindro/MHD/KurganovMHD/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 2.59808;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           uniform 2.59808;
    }
    cilindro
    {
        type            calculated;
        value           nonuniform List<scalar> 
119
(
0.0171471
0.0514384
0.0857208
0.119988
0.154235
0.188454
0.222641
0.256789
...
)
;
    }
    front_back
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 2.59808;
    }
    simetria
    {
        type            calculated;
        value           uniform 2.59808;
    }
}


// ************************************************************************* //
